bench/results/after-equal-load.txt
LedgerGuard - AFTER at the BASELINE load profile (like-for-like)
================================================================
Captured      : 2026-08-01 (see run timestamps below)
Target        : https://ledgerguard.duvalkwali.tech (live)
Backend commit: 46ad6f3
Container     : 0.75 CPU / 768 MB, identical limits to the baseline run
Script        : baseline.js - the SAME 10/50/100 VU profile as before.txt.
                after.txt pushes 200 VUs to find the ceiling, so its latencies
                are not comparable with before.txt. This run changes only the
                implementation and holds the load identical.
Ledger state  : reset, then seeded with 500 screened transactions

METHODOLOGY - why this is the median of several runs, not a single one
----------------------------------------------------------------
Throughput on this deployment is bimodal against JIT warmup. A run started
immediately after a container restart sees a cold JVM and lands near 132 req/s;
once the hot paths are compiled the same script and the same box settle around
230 req/s. Reporting whichever run happened to come first would be misleading in
one direction or the other, so the figure published on the dashboard is the
MEDIAN of three warm runs. All three had a 0.00% error rate.

  warm run 1 : p50  79.02ms  p95 206.89ms  p99 324.65ms  226.8 req/s  max 1.10s
  warm run 2 : p50  63.37ms  p95 192.34ms  p99 308.26ms  241.6 req/s  max 0.76s
  warm run 3 : p50  76.50ms  p95 205.25ms  p99 314.09ms  230.4 req/s  max 0.68s  <-- median, printed below
  cold run   : p50 184.62ms  p95 425.59ms  p99 722.68ms  132.5 req/s  max 19.33s (first run after restart)

The baseline in before.txt is a single run and is left exactly as captured -
it was recorded before any optimization existed and has not been re-measured.
It is therefore the conservative side of this comparison.
================================================================


         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 3m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-08-01T05:43:57Z" level=info msg="baseline: authenticated against https://ledgerguard.duvalkwali.tech" source=console

running (0m01.0s), 001/100 VUs, 4 complete and 0 interrupted iterations
default   [   0% ] 001/100 VUs  0m00.8s/3m00.0s

running (0m02.0s), 001/100 VUs, 11 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m01.8s/3m00.0s

running (0m03.0s), 001/100 VUs, 18 complete and 0 interrupted iterations
default   [   2% ] 001/100 VUs  0m02.8s/3m00.0s

running (0m04.0s), 002/100 VUs, 27 complete and 0 interrupted iterations
default   [   2% ] 002/100 VUs  0m03.8s/3m00.0s

running (0m05.0s), 002/100 VUs, 41 complete and 0 interrupted iterations
default   [   3% ] 002/100 VUs  0m04.8s/3m00.0s

running (0m06.0s), 002/100 VUs, 56 complete and 0 interrupted iterations
default   [   3% ] 002/100 VUs  0m05.8s/3m00.0s

running (0m07.0s), 003/100 VUs, 71 complete and 0 interrupted iterations
default   [   4% ] 003/100 VUs  0m06.8s/3m00.0s

running (0m08.0s), 003/100 VUs, 92 complete and 0 interrupted iterations
default   [   4% ] 003/100 VUs  0m07.8s/3m00.0s

running (0m09.0s), 003/100 VUs, 113 complete and 0 interrupted iterations
default   [   5% ] 003/100 VUs  0m08.8s/3m00.0s

running (0m10.0s), 003/100 VUs, 134 complete and 0 interrupted iterations
default   [   5% ] 003/100 VUs  0m09.8s/3m00.0s

running (0m11.0s), 004/100 VUs, 159 complete and 0 interrupted iterations
default   [   6% ] 004/100 VUs  0m10.8s/3m00.0s

running (0m12.0s), 004/100 VUs, 189 complete and 0 interrupted iterations
default   [   7% ] 004/100 VUs  0m11.8s/3m00.0s

running (0m13.0s), 004/100 VUs, 219 complete and 0 interrupted iterations
default   [   7% ] 004/100 VUs  0m12.8s/3m00.0s

running (0m14.0s), 005/100 VUs, 250 complete and 0 interrupted iterations
default   [   8% ] 005/100 VUs  0m13.8s/3m00.0s

running (0m15.0s), 005/100 VUs, 286 complete and 0 interrupted iterations
default   [   8% ] 005/100 VUs  0m14.8s/3m00.0s

running (0m16.0s), 005/100 VUs, 322 complete and 0 interrupted iterations
default   [   9% ] 005/100 VUs  0m15.8s/3m00.0s

running (0m17.0s), 006/100 VUs, 359 complete and 0 interrupted iterations
default   [   9% ] 006/100 VUs  0m16.8s/3m00.0s

running (0m18.0s), 006/100 VUs, 402 complete and 0 interrupted iterations
default   [  10% ] 006/100 VUs  0m17.8s/3m00.0s

running (0m19.0s), 006/100 VUs, 444 complete and 0 interrupted iterations
default   [  10% ] 006/100 VUs  0m18.8s/3m00.0s

running (0m20.0s), 006/100 VUs, 487 complete and 0 interrupted iterations
default   [  11% ] 006/100 VUs  0m19.8s/3m00.0s

running (0m21.0s), 007/100 VUs, 539 complete and 0 interrupted iterations
default   [  12% ] 007/100 VUs  0m20.8s/3m00.0s

running (0m22.0s), 007/100 VUs, 588 complete and 0 interrupted iterations
default   [  12% ] 007/100 VUs  0m21.8s/3m00.0s

running (0m23.0s), 007/100 VUs, 639 complete and 0 interrupted iterations
default   [  13% ] 007/100 VUs  0m22.8s/3m00.0s

running (0m24.0s), 008/100 VUs, 691 complete and 0 interrupted iterations
default   [  13% ] 008/100 VUs  0m23.8s/3m00.0s

running (0m25.0s), 008/100 VUs, 750 complete and 0 interrupted iterations
default   [  14% ] 008/100 VUs  0m24.8s/3m00.0s

running (0m26.0s), 008/100 VUs, 807 complete and 0 interrupted iterations
default   [  14% ] 008/100 VUs  0m25.8s/3m00.0s

running (0m27.0s), 009/100 VUs, 867 complete and 0 interrupted iterations
default   [  15% ] 009/100 VUs  0m26.8s/3m00.0s

running (0m28.0s), 009/100 VUs, 931 complete and 0 interrupted iterations
default   [  15% ] 009/100 VUs  0m27.8s/3m00.0s

running (0m29.0s), 009/100 VUs, 996 complete and 0 interrupted iterations
default   [  16% ] 009/100 VUs  0m28.8s/3m00.0s

running (0m30.0s), 009/100 VUs, 1062 complete and 0 interrupted iterations
default   [  17% ] 009/100 VUs  0m29.8s/3m00.0s

running (0m31.0s), 010/100 VUs, 1132 complete and 0 interrupted iterations
default   [  17% ] 010/100 VUs  0m30.8s/3m00.0s

running (0m32.0s), 011/100 VUs, 1190 complete and 0 interrupted iterations
default   [  18% ] 011/100 VUs  0m31.8s/3m00.0s

running (0m33.0s), 011/100 VUs, 1245 complete and 0 interrupted iterations
default   [  18% ] 011/100 VUs  0m32.8s/3m00.0s

running (0m34.0s), 012/100 VUs, 1302 complete and 0 interrupted iterations
default   [  19% ] 012/100 VUs  0m33.8s/3m00.0s

running (0m35.0s), 013/100 VUs, 1363 complete and 0 interrupted iterations
default   [  19% ] 013/100 VUs  0m34.8s/3m00.0s

running (0m36.0s), 013/100 VUs, 1453 complete and 0 interrupted iterations
default   [  20% ] 013/100 VUs  0m35.8s/3m00.0s

running (0m37.0s), 014/100 VUs, 1550 complete and 0 interrupted iterations
default   [  20% ] 014/100 VUs  0m36.8s/3m00.0s

running (0m38.0s), 015/100 VUs, 1647 complete and 0 interrupted iterations
default   [  21% ] 015/100 VUs  0m37.8s/3m00.0s

running (0m39.0s), 015/100 VUs, 1751 complete and 0 interrupted iterations
default   [  22% ] 015/100 VUs  0m38.8s/3m00.0s

running (0m40.0s), 016/100 VUs, 1861 complete and 0 interrupted iterations
default   [  22% ] 016/100 VUs  0m39.8s/3m00.0s

running (0m41.0s), 017/100 VUs, 1976 complete and 0 interrupted iterations
default   [  23% ] 017/100 VUs  0m40.8s/3m00.0s

running (0m42.0s), 017/100 VUs, 2100 complete and 0 interrupted iterations
default   [  23% ] 017/100 VUs  0m41.8s/3m00.0s

running (0m43.0s), 018/100 VUs, 2224 complete and 0 interrupted iterations
default   [  24% ] 018/100 VUs  0m42.8s/3m00.0s

running (0m44.0s), 019/100 VUs, 2354 complete and 0 interrupted iterations
default   [  24% ] 019/100 VUs  0m43.8s/3m00.0s

running (0m45.0s), 019/100 VUs, 2486 complete and 0 interrupted iterations
default   [  25% ] 019/100 VUs  0m44.8s/3m00.0s

running (0m46.0s), 020/100 VUs, 2621 complete and 0 interrupted iterations
default   [  25% ] 020/100 VUs  0m45.8s/3m00.0s

running (0m47.0s), 021/100 VUs, 2768 complete and 0 interrupted iterations
default   [  26% ] 021/100 VUs  0m46.8s/3m00.0s

running (0m48.0s), 021/100 VUs, 2917 complete and 0 interrupted iterations
default   [  27% ] 021/100 VUs  0m47.8s/3m00.0s

running (0m49.0s), 022/100 VUs, 3074 complete and 0 interrupted iterations
default   [  27% ] 022/100 VUs  0m48.8s/3m00.0s

running (0m50.0s), 023/100 VUs, 3232 complete and 0 interrupted iterations
default   [  28% ] 023/100 VUs  0m49.8s/3m00.0s

running (0m51.0s), 023/100 VUs, 3394 complete and 0 interrupted iterations
default   [  28% ] 023/100 VUs  0m50.8s/3m00.0s

running (0m52.0s), 024/100 VUs, 3564 complete and 0 interrupted iterations
default   [  29% ] 024/100 VUs  0m51.8s/3m00.0s

running (0m53.0s), 025/100 VUs, 3735 complete and 0 interrupted iterations
default   [  29% ] 025/100 VUs  0m52.8s/3m00.0s

running (0m54.0s), 025/100 VUs, 3921 complete and 0 interrupted iterations
default   [  30% ] 025/100 VUs  0m53.8s/3m00.0s

running (0m55.0s), 026/100 VUs, 4098 complete and 0 interrupted iterations
default   [  30% ] 026/100 VUs  0m54.8s/3m00.0s

running (0m56.0s), 027/100 VUs, 4283 complete and 0 interrupted iterations
default   [  31% ] 027/100 VUs  0m55.8s/3m00.0s

running (0m57.0s), 027/100 VUs, 4477 complete and 0 interrupted iterations
default   [  32% ] 027/100 VUs  0m56.8s/3m00.0s

running (0m58.0s), 028/100 VUs, 4661 complete and 0 interrupted iterations
default   [  32% ] 028/100 VUs  0m57.8s/3m00.0s

running (0m59.0s), 029/100 VUs, 4861 complete and 0 interrupted iterations
default   [  33% ] 029/100 VUs  0m58.8s/3m00.0s

running (1m00.0s), 029/100 VUs, 5065 complete and 0 interrupted iterations
default   [  33% ] 029/100 VUs  0m59.8s/3m00.0s

running (1m01.0s), 030/100 VUs, 5280 complete and 0 interrupted iterations
default   [  34% ] 030/100 VUs  1m00.8s/3m00.0s

running (1m02.0s), 031/100 VUs, 5490 complete and 0 interrupted iterations
default   [  34% ] 031/100 VUs  1m01.8s/3m00.0s

running (1m03.0s), 031/100 VUs, 5709 complete and 0 interrupted iterations
default   [  35% ] 031/100 VUs  1m02.8s/3m00.0s

running (1m04.0s), 032/100 VUs, 5899 complete and 0 interrupted iterations
default   [  35% ] 032/100 VUs  1m03.8s/3m00.0s

running (1m05.0s), 033/100 VUs, 6041 complete and 0 interrupted iterations
default   [  36% ] 033/100 VUs  1m04.8s/3m00.0s

running (1m06.0s), 033/100 VUs, 6225 complete and 0 interrupted iterations
default   [  37% ] 033/100 VUs  1m05.8s/3m00.0s

running (1m07.0s), 034/100 VUs, 6413 complete and 0 interrupted iterations
default   [  37% ] 034/100 VUs  1m06.8s/3m00.0s

running (1m08.0s), 035/100 VUs, 6632 complete and 0 interrupted iterations
default   [  38% ] 035/100 VUs  1m07.8s/3m00.0s

running (1m09.0s), 035/100 VUs, 6851 complete and 0 interrupted iterations
default   [  38% ] 035/100 VUs  1m08.8s/3m00.0s

running (1m10.0s), 036/100 VUs, 7071 complete and 0 interrupted iterations
default   [  39% ] 036/100 VUs  1m09.8s/3m00.0s

running (1m11.0s), 037/100 VUs, 7280 complete and 0 interrupted iterations
default   [  39% ] 037/100 VUs  1m10.8s/3m00.0s

running (1m12.0s), 037/100 VUs, 7497 complete and 0 interrupted iterations
default   [  40% ] 037/100 VUs  1m11.8s/3m00.0s

running (1m13.0s), 038/100 VUs, 7737 complete and 0 interrupted iterations
default   [  40% ] 038/100 VUs  1m12.8s/3m00.0s

running (1m14.0s), 039/100 VUs, 7967 complete and 0 interrupted iterations
default   [  41% ] 039/100 VUs  1m13.8s/3m00.0s

running (1m15.0s), 039/100 VUs, 8212 complete and 0 interrupted iterations
default   [  42% ] 039/100 VUs  1m14.8s/3m00.0s

running (1m16.0s), 040/100 VUs, 8459 complete and 0 interrupted iterations
default   [  42% ] 040/100 VUs  1m15.8s/3m00.0s

running (1m17.0s), 041/100 VUs, 8697 complete and 0 interrupted iterations
default   [  43% ] 041/100 VUs  1m16.8s/3m00.0s

running (1m18.0s), 041/100 VUs, 8956 complete and 0 interrupted iterations
default   [  43% ] 041/100 VUs  1m17.8s/3m00.0s

running (1m19.0s), 042/100 VUs, 9222 complete and 0 interrupted iterations
default   [  44% ] 042/100 VUs  1m18.8s/3m00.0s

running (1m20.0s), 043/100 VUs, 9481 complete and 0 interrupted iterations
default   [  44% ] 043/100 VUs  1m19.8s/3m00.0s

running (1m21.0s), 043/100 VUs, 9756 complete and 0 interrupted iterations
default   [  45% ] 043/100 VUs  1m20.8s/3m00.0s

running (1m22.0s), 044/100 VUs, 10026 complete and 0 interrupted iterations
default   [  45% ] 044/100 VUs  1m21.8s/3m00.0s

running (1m23.0s), 045/100 VUs, 10300 complete and 0 interrupted iterations
default   [  46% ] 045/100 VUs  1m22.8s/3m00.0s

running (1m24.0s), 045/100 VUs, 10588 complete and 0 interrupted iterations
default   [  47% ] 045/100 VUs  1m23.8s/3m00.0s

running (1m25.0s), 046/100 VUs, 10863 complete and 0 interrupted iterations
default   [  47% ] 046/100 VUs  1m24.8s/3m00.0s

running (1m26.0s), 047/100 VUs, 11140 complete and 0 interrupted iterations
default   [  48% ] 047/100 VUs  1m25.8s/3m00.0s

running (1m27.0s), 047/100 VUs, 11422 complete and 0 interrupted iterations
default   [  48% ] 047/100 VUs  1m26.8s/3m00.0s

running (1m28.0s), 048/100 VUs, 11694 complete and 0 interrupted iterations
default   [  49% ] 048/100 VUs  1m27.8s/3m00.0s

running (1m29.0s), 049/100 VUs, 11976 complete and 0 interrupted iterations
default   [  49% ] 049/100 VUs  1m28.8s/3m00.0s

running (1m30.0s), 049/100 VUs, 12272 complete and 0 interrupted iterations
default   [  50% ] 049/100 VUs  1m29.8s/3m00.0s

running (1m31.0s), 050/100 VUs, 12554 complete and 0 interrupted iterations
default   [  50% ] 050/100 VUs  1m30.8s/3m00.0s

running (1m32.0s), 051/100 VUs, 12856 complete and 0 interrupted iterations
default   [  51% ] 051/100 VUs  1m31.8s/3m00.0s

running (1m33.0s), 052/100 VUs, 13140 complete and 0 interrupted iterations
default   [  52% ] 052/100 VUs  1m32.8s/3m00.0s

running (1m34.0s), 053/100 VUs, 13449 complete and 0 interrupted iterations
default   [  52% ] 053/100 VUs  1m33.8s/3m00.0s

running (1m35.0s), 053/100 VUs, 13768 complete and 0 interrupted iterations
default   [  53% ] 053/100 VUs  1m34.8s/3m00.0s

running (1m36.0s), 054/100 VUs, 14078 complete and 0 interrupted iterations
default   [  53% ] 054/100 VUs  1m35.8s/3m00.0s

running (1m37.0s), 055/100 VUs, 14394 complete and 0 interrupted iterations
default   [  54% ] 055/100 VUs  1m36.8s/3m00.0s

running (1m38.0s), 056/100 VUs, 14733 complete and 0 interrupted iterations
default   [  54% ] 056/100 VUs  1m37.8s/3m00.0s

running (1m39.0s), 057/100 VUs, 15074 complete and 0 interrupted iterations
default   [  55% ] 057/100 VUs  1m38.8s/3m00.0s

running (1m40.0s), 058/100 VUs, 15420 complete and 0 interrupted iterations
default   [  55% ] 058/100 VUs  1m39.8s/3m00.0s

running (1m41.0s), 058/100 VUs, 15724 complete and 0 interrupted iterations
default   [  56% ] 058/100 VUs  1m40.8s/3m00.0s

running (1m42.0s), 059/100 VUs, 16064 complete and 0 interrupted iterations
default   [  57% ] 059/100 VUs  1m41.8s/3m00.0s

running (1m43.0s), 060/100 VUs, 16417 complete and 0 interrupted iterations
default   [  57% ] 060/100 VUs  1m42.8s/3m00.0s

running (1m44.0s), 061/100 VUs, 16760 complete and 0 interrupted iterations
default   [  58% ] 061/100 VUs  1m43.8s/3m00.0s

running (1m45.0s), 062/100 VUs, 17111 complete and 0 interrupted iterations
default   [  58% ] 062/100 VUs  1m44.8s/3m00.0s

running (1m46.0s), 063/100 VUs, 17473 complete and 0 interrupted iterations
default   [  59% ] 063/100 VUs  1m45.8s/3m00.0s

running (1m47.0s), 063/100 VUs, 17799 complete and 0 interrupted iterations
default   [  59% ] 063/100 VUs  1m46.8s/3m00.0s

running (1m48.0s), 064/100 VUs, 18145 complete and 0 interrupted iterations
default   [  60% ] 064/100 VUs  1m47.8s/3m00.0s

running (1m49.0s), 065/100 VUs, 18507 complete and 0 interrupted iterations
default   [  60% ] 065/100 VUs  1m48.8s/3m00.0s

running (1m50.0s), 066/100 VUs, 18820 complete and 0 interrupted iterations
default   [  61% ] 066/100 VUs  1m49.8s/3m00.0s

running (1m51.0s), 067/100 VUs, 19154 complete and 0 interrupted iterations
default   [  62% ] 067/100 VUs  1m50.8s/3m00.0s

running (1m52.0s), 068/100 VUs, 19510 complete and 0 interrupted iterations
default   [  62% ] 068/100 VUs  1m51.8s/3m00.0s

running (1m53.0s), 068/100 VUs, 19872 complete and 0 interrupted iterations
default   [  63% ] 068/100 VUs  1m52.8s/3m00.0s

running (1m54.0s), 069/100 VUs, 20235 complete and 0 interrupted iterations
default   [  63% ] 069/100 VUs  1m53.8s/3m00.0s

running (1m55.0s), 070/100 VUs, 20575 complete and 0 interrupted iterations
default   [  64% ] 070/100 VUs  1m54.8s/3m00.0s

running (1m56.0s), 071/100 VUs, 20940 complete and 0 interrupted iterations
default   [  64% ] 071/100 VUs  1m55.8s/3m00.0s

running (1m57.0s), 072/100 VUs, 21299 complete and 0 interrupted iterations
default   [  65% ] 072/100 VUs  1m56.8s/3m00.0s

running (1m58.0s), 073/100 VUs, 21672 complete and 0 interrupted iterations
default   [  65% ] 073/100 VUs  1m57.8s/3m00.0s

running (1m59.0s), 073/100 VUs, 22015 complete and 0 interrupted iterations
default   [  66% ] 073/100 VUs  1m58.8s/3m00.0s

running (2m00.0s), 074/100 VUs, 22363 complete and 0 interrupted iterations
default   [  67% ] 074/100 VUs  1m59.8s/3m00.0s

running (2m01.0s), 075/100 VUs, 22730 complete and 0 interrupted iterations
default   [  67% ] 075/100 VUs  2m00.8s/3m00.0s

running (2m02.0s), 076/100 VUs, 23106 complete and 0 interrupted iterations
default   [  68% ] 076/100 VUs  2m01.8s/3m00.0s

running (2m03.0s), 077/100 VUs, 23413 complete and 0 interrupted iterations
default   [  68% ] 077/100 VUs  2m02.8s/3m00.0s

running (2m04.0s), 078/100 VUs, 23717 complete and 0 interrupted iterations
default   [  69% ] 078/100 VUs  2m03.8s/3m00.0s

running (2m05.0s), 078/100 VUs, 24037 complete and 0 interrupted iterations
default   [  69% ] 078/100 VUs  2m04.8s/3m00.0s

running (2m06.0s), 079/100 VUs, 24403 complete and 0 interrupted iterations
default   [  70% ] 079/100 VUs  2m05.8s/3m00.0s

running (2m07.0s), 080/100 VUs, 24736 complete and 0 interrupted iterations
default   [  70% ] 080/100 VUs  2m06.8s/3m00.0s

running (2m08.0s), 081/100 VUs, 25079 complete and 0 interrupted iterations
default   [  71% ] 081/100 VUs  2m07.8s/3m00.0s

running (2m09.0s), 082/100 VUs, 25444 complete and 0 interrupted iterations
default   [  72% ] 082/100 VUs  2m08.8s/3m00.0s

running (2m10.0s), 083/100 VUs, 25775 complete and 0 interrupted iterations
default   [  72% ] 083/100 VUs  2m09.8s/3m00.0s

running (2m11.0s), 083/100 VUs, 26112 complete and 0 interrupted iterations
default   [  73% ] 083/100 VUs  2m10.8s/3m00.0s

running (2m12.0s), 084/100 VUs, 26450 complete and 0 interrupted iterations
default   [  73% ] 084/100 VUs  2m11.8s/3m00.0s

running (2m13.0s), 085/100 VUs, 26762 complete and 0 interrupted iterations
default   [  74% ] 085/100 VUs  2m12.8s/3m00.0s

running (2m14.0s), 086/100 VUs, 27096 complete and 0 interrupted iterations
default   [  74% ] 086/100 VUs  2m13.8s/3m00.0s

running (2m15.0s), 087/100 VUs, 27471 complete and 0 interrupted iterations
default   [  75% ] 087/100 VUs  2m14.8s/3m00.0s

running (2m16.0s), 088/100 VUs, 27843 complete and 0 interrupted iterations
default   [  75% ] 088/100 VUs  2m15.8s/3m00.0s

running (2m17.0s), 088/100 VUs, 28231 complete and 0 interrupted iterations
default   [  76% ] 088/100 VUs  2m16.8s/3m00.0s

running (2m18.0s), 089/100 VUs, 28623 complete and 0 interrupted iterations
default   [  77% ] 089/100 VUs  2m17.8s/3m00.0s

running (2m19.0s), 090/100 VUs, 29003 complete and 0 interrupted iterations
default   [  77% ] 090/100 VUs  2m18.8s/3m00.0s

running (2m20.0s), 091/100 VUs, 29383 complete and 0 interrupted iterations
default   [  78% ] 091/100 VUs  2m19.8s/3m00.0s

running (2m21.0s), 092/100 VUs, 29784 complete and 0 interrupted iterations
default   [  78% ] 092/100 VUs  2m20.8s/3m00.0s

running (2m22.0s), 093/100 VUs, 30130 complete and 0 interrupted iterations
default   [  79% ] 093/100 VUs  2m21.8s/3m00.0s

running (2m23.0s), 093/100 VUs, 30505 complete and 0 interrupted iterations
default   [  79% ] 093/100 VUs  2m22.8s/3m00.0s

running (2m24.0s), 094/100 VUs, 30897 complete and 0 interrupted iterations
default   [  80% ] 094/100 VUs  2m23.8s/3m00.0s

running (2m25.0s), 095/100 VUs, 31276 complete and 0 interrupted iterations
default   [  80% ] 095/100 VUs  2m24.8s/3m00.0s

running (2m26.0s), 096/100 VUs, 31600 complete and 0 interrupted iterations
default   [  81% ] 096/100 VUs  2m25.8s/3m00.0s

running (2m27.0s), 097/100 VUs, 32005 complete and 0 interrupted iterations
default   [  82% ] 097/100 VUs  2m26.8s/3m00.0s

running (2m28.0s), 098/100 VUs, 32376 complete and 0 interrupted iterations
default   [  82% ] 098/100 VUs  2m27.8s/3m00.0s

running (2m29.0s), 098/100 VUs, 32786 complete and 0 interrupted iterations
default   [  83% ] 098/100 VUs  2m28.8s/3m00.0s

running (2m30.0s), 099/100 VUs, 33137 complete and 0 interrupted iterations
default   [  83% ] 099/100 VUs  2m29.8s/3m00.0s

running (2m31.0s), 098/100 VUs, 33554 complete and 0 interrupted iterations
default   [  84% ] 098/100 VUs  2m30.8s/3m00.0s

running (2m32.0s), 095/100 VUs, 33905 complete and 0 interrupted iterations
default   [  84% ] 095/100 VUs  2m31.8s/3m00.0s

running (2m33.0s), 092/100 VUs, 34289 complete and 0 interrupted iterations
default   [  85% ] 092/100 VUs  2m32.8s/3m00.0s

running (2m34.0s), 088/100 VUs, 34659 complete and 0 interrupted iterations
default   [  85% ] 088/100 VUs  2m33.8s/3m00.0s

running (2m35.0s), 085/100 VUs, 35052 complete and 0 interrupted iterations
default   [  86% ] 085/100 VUs  2m34.8s/3m00.0s

running (2m36.0s), 082/100 VUs, 35464 complete and 0 interrupted iterations
default   [  87% ] 082/100 VUs  2m35.8s/3m00.0s

running (2m37.0s), 078/100 VUs, 35881 complete and 0 interrupted iterations
default   [  87% ] 078/100 VUs  2m36.8s/3m00.0s

running (2m38.0s), 075/100 VUs, 36283 complete and 0 interrupted iterations
default   [  88% ] 075/100 VUs  2m37.8s/3m00.0s

running (2m39.0s), 072/100 VUs, 36658 complete and 0 interrupted iterations
default   [  88% ] 072/100 VUs  2m38.8s/3m00.0s

running (2m40.0s), 068/100 VUs, 37035 complete and 0 interrupted iterations
default   [  89% ] 068/100 VUs  2m39.8s/3m00.0s

running (2m41.0s), 065/100 VUs, 37385 complete and 0 interrupted iterations
default   [  89% ] 065/100 VUs  2m40.8s/3m00.0s

running (2m42.0s), 061/100 VUs, 37762 complete and 0 interrupted iterations
default   [  90% ] 061/100 VUs  2m41.8s/3m00.0s

running (2m43.0s), 058/100 VUs, 38139 complete and 0 interrupted iterations
default   [  90% ] 058/100 VUs  2m42.8s/3m00.0s

running (2m44.0s), 055/100 VUs, 38478 complete and 0 interrupted iterations
default   [  91% ] 055/100 VUs  2m43.8s/3m00.0s

running (2m45.0s), 052/100 VUs, 38812 complete and 0 interrupted iterations
default   [  92% ] 052/100 VUs  2m44.8s/3m00.0s

running (2m46.0s), 048/100 VUs, 39124 complete and 0 interrupted iterations
default   [  92% ] 048/100 VUs  2m45.8s/3m00.0s

running (2m47.0s), 045/100 VUs, 39413 complete and 0 interrupted iterations
default   [  93% ] 045/100 VUs  2m46.8s/3m00.0s

running (2m48.0s), 041/100 VUs, 39690 complete and 0 interrupted iterations
default   [  93% ] 041/100 VUs  2m47.8s/3m00.0s

running (2m49.0s), 038/100 VUs, 39972 complete and 0 interrupted iterations
default   [  94% ] 038/100 VUs  2m48.8s/3m00.0s

running (2m50.0s), 035/100 VUs, 40217 complete and 0 interrupted iterations
default   [  94% ] 035/100 VUs  2m49.8s/3m00.0s

running (2m51.0s), 031/100 VUs, 40456 complete and 0 interrupted iterations
default   [  95% ] 031/100 VUs  2m50.8s/3m00.0s

running (2m52.0s), 028/100 VUs, 40663 complete and 0 interrupted iterations
default   [  95% ] 028/100 VUs  2m51.8s/3m00.0s

running (2m53.0s), 025/100 VUs, 40855 complete and 0 interrupted iterations
default   [  96% ] 025/100 VUs  2m52.8s/3m00.0s

running (2m54.0s), 021/100 VUs, 41021 complete and 0 interrupted iterations
default   [  97% ] 021/100 VUs  2m53.8s/3m00.0s

running (2m55.0s), 018/100 VUs, 41158 complete and 0 interrupted iterations
default   [  97% ] 018/100 VUs  2m54.8s/3m00.0s

running (2m56.0s), 015/100 VUs, 41276 complete and 0 interrupted iterations
default   [  98% ] 015/100 VUs  2m55.8s/3m00.0s

running (2m57.0s), 012/100 VUs, 41368 complete and 0 interrupted iterations
default   [  98% ] 012/100 VUs  2m56.8s/3m00.0s

running (2m58.0s), 008/100 VUs, 41442 complete and 0 interrupted iterations
default   [  99% ] 008/100 VUs  2m57.8s/3m00.0s

running (2m59.0s), 005/100 VUs, 41491 complete and 0 interrupted iterations
default   [  99% ] 005/100 VUs  2m58.8s/3m00.0s

running (3m00.0s), 002/100 VUs, 41516 complete and 0 interrupted iterations
default   [ 100% ] 002/100 VUs  2m59.8s/3m00.0s


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.05' rate=0.00%

    screen_latency
    ✓ 'p(95)<5000' p(95)=205.25ms


  █ TOTAL RESULTS 

    checks_total.......: 83038   460.749449/s
    checks_succeeded...: 100.00% 83038 out of 83038
    checks_failed......: 0.00%   0 out of 83038

    ✓ status is 200
    ✓ decision is PASS|FLAG|REJECT

    CUSTOM
    errors.........................: 0.00% 0 out of 41519
    screen_latency.................: avg=89.42ms  min=24.25ms  med=76.5ms   p(90)=183.63ms p(95)=205.25ms p(99)=314.09ms max=678.75ms

    HTTP
    http_req_duration..............: avg=89.42ms  min=24.25ms  med=76.5ms   p(90)=183.63ms p(95)=205.25ms p(99)=314.09ms max=678.75ms
      { expected_response:true }...: avg=89.42ms  min=24.25ms  med=76.5ms   p(90)=183.63ms p(95)=205.25ms p(99)=314.09ms max=678.75ms
    http_req_failed................: 0.00% 0 out of 41520
    http_reqs......................: 41520 230.380273/s

    EXECUTION
    iteration_duration.............: avg=190.53ms min=124.86ms med=177.63ms p(90)=285ms    p(95)=306.81ms p(99)=415.87ms max=779.43ms
    iterations.....................: 41519 230.374725/s
    vus............................: 2     min=1          max=99 
    vus_max........................: 100   min=100        max=100

    NETWORK
    data_received..................: 12 MB 66 kB/s
    data_sent......................: 12 MB 67 kB/s



running (3m00.2s), 000/100 VUs, 41519 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  3m0s